Revit 2027 API
GBXMLExportOptions.ExportAnalyticalSystems Property
Note: This API is now obsolete.
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Revit will always export AnalyticalSystems at that point.")]
public bool ExportAnalyticalSystems { get; set; }
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Revit will always export AnalyticalSystems at that point.")>
Public Property ExportAnalyticalSystems As Boolean
	Get
	Set
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Revit will always export AnalyticalSystems at that point.")]
property bool ExportAnalyticalSystems {
	bool get ();
	void set (bool value);
}
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Revit will always export AnalyticalSystems at that point.")>]
member ExportAnalyticalSystems : bool with get, set
Property Value
Boolean
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace